import React, { PureComponent } from 'react';
import { AreaChart, Area, XAxis, YAxis, CartesianGrid, Tooltip, Legend, ResponsiveContainer } from 'recharts';



const data = [
    { 
     "년도" : "1989",
     "해수면 높이":"0.1"
     },
     { 
     "년도" : "1990",
     "해수면 높이":"-0.9"
     },
     { 
     "년도" : "1991",
     "해수면 높이":"-0.1"
     },
     { 
     "년도" : "1992",
     "해수면 높이":"0.5"
     },
     { 
     "년도" : "1993",
     "해수면 높이":"-2.5"
     },
     { 
     "년도" : "1994",
     "해수면 높이":"-0.9"
     },
     { 
     "년도" : "1995",
     "해수면 높이":"-2.1"
     },
     { 
     "년도" : "1996",
     "해수면 높이":"-2.4"
     },
     { 
     "년도" : "1997",
     "해수면 높이":"-0.6"
     },
     { 
     "년도" : "1998",
     "해수면 높이":"2.6"
     },
     { 
     "년도" : "1999",
     "해수면 높이":"3.2"
     },
     { 
     "년도" : "2000",
     "해수면 높이":"2.0"
     },
     { 
     "년도" : "2001",
     "해수면 높이":"2.4"
     },
     { 
     "년도" : "2002",
     "해수면 높이":"3.5"
     },
     { 
     "년도" : "2003",
     "해수면 높이":"3.4"
     },
     { 
     "년도" : "2004",
     "해수면 높이":"3.6"
     },
     { 
     "년도" : "2005",
     "해수면 높이":"0.6"
     },
     { 
     "년도" : "2006",
     "해수면 높이":"3.1"
     },
     { 
     "년도" : "2007",
     "해수면 높이":"3.2"
     },
     { 
     "년도" : "2008",
     "해수면 높이":"1.8"
     },
     { 
     "년도" : "2009",
     "해수면 높이":"3.2"
     },
     { 
     "년도" : "2010",
     "해수면 높이":"3.5"
     },
     { 
     "년도" : "2011",
     "해수면 높이":"2.3"
     },
     { 
     "년도" : "2012",
     "해수면 높이":"6.4"
     },
     { 
     "년도" : "2013",
     "해수면 높이":"4.5"
     },
     { 
     "년도" : "2014",
     "해수면 높이":"5.9"
     },
     { 
     "년도" : "2015",
     "해수면 높이":"6.3"
     },
     { 
     "년도" : "2016",
     "해수면 높이":"9.5"
     },
     { 
     "년도" : "2017",
     "해수면 높이":"5.1"
     },
     { 
     "년도" : "2018",
     "해수면 높이":"4.6"
     },
     { 
     "년도" : "2019",
     "해수면 높이":"7.6"
     },
     { 
     "년도" : "2020",
     "해수면 높이":"9.1"
     }
 ]
const SeaLevel = () => {
  return (
    <>
    <ResponsiveContainer width="80%" aspect={4}>
      <AreaChart
        width={500}
        height={300}
        data={data}
        margin={{
          top: 5,
          right: 30,
          left: 20,
          bottom: 5,
        }}
      >
        <CartesianGrid strokeDasharray="3 3" />
        <XAxis dataKey="년도" />
        <YAxis />
        <Tooltip />
        <Legend/>
        <Area type='number' dataKey="해수면 높이" fill='#8bdeeb' stroke='#06b4cf' />
       
        
      </AreaChart>
    </ResponsiveContainer>
    </>

    
    
  );
};
export default SeaLevel;
